TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_m0p_hw_sysctl_mspm0g1x0x_g3x0x__include
#define ti_devices_msp_peripherals_m0p_hw_sysctl_mspm0g1x0x_g3x0x__include

/* Filename: hw_sysctl_mspm0g1x0x_g3x0x.h */
/* Revised: 2023-06-10 20:11:25 */
/* Revision: 654ee49b8da203f200540fbb92f63e5ecb4fbfe3 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* SYSCTL Registers
******************************************************************************/
#define SYSCTL_MGMT_TMALITE1_OFS                 ((uint32_t)0x00900800U)
#define SYSCTL_MGMT_GPTIMER32B2CC0_OFS           ((uint32_t)0x00870800U)
#define SYSCTL_MGMT_GPTIMER16B2CCSP1_OFS         ((uint32_t)0x0086A800U)
#define SYSCTL_MGMT_GPTIMER16B2CCSP0_OFS         ((uint32_t)0x00868800U)
#define SYSCTL_MGMT_GPTIMER16BADV2CC0_OFS        ((uint32_t)0x00862800U)
#define SYSCTL_MGMT_GPTIMER16BADV4CC0_OFS        ((uint32_t)0x00860800U)
#define SYSCTL_MGMT_MCAN0_OFS                    ((uint32_t)0x0050E800U)
#define SYSCTL_MGMT_UART0_OFS                    ((uint32_t)0x00500800U)
#define SYSCTL_MGMT_SPI1_OFS                     ((uint32_t)0x0046A800U)
#define SYSCTL_MGMT_SPI0_OFS                     ((uint32_t)0x00468800U)
#define SYSCTL_MGMT_TRNG_OFS                     ((uint32_t)0x00444800U)
#define SYSCTL_MGMT_AES_OFS                      ((uint32_t)0x00442800U)
#define SYSCTL_MGMT_CRC0_OFS                     ((uint32_t)0x00440800U)
#define SYSCTL_MGMT_MATHACL_OFS                  ((uint32_t)0x00410800U)
#define SYSCTL_MGMT_UARTADVLP0_OFS               ((uint32_t)0x00108800U)
#define SYSCTL_MGMT_UARTLP1_OFS                  ((uint32_t)0x00102800U)
#define SYSCTL_MGMT_UARTLP0_OFS                  ((uint32_t)0x00100800U)
#define SYSCTL_MGMT_I2C1_OFS                     ((uint32_t)0x000F2800U)
#define SYSCTL_MGMT_I2C0_OFS                     ((uint32_t)0x000F0800U)
#define SYSCTL_MGMT_GPIO1_OFS                    ((uint32_t)0x000A2800U)
#define SYSCTL_MGMT_GPIO0_OFS                    ((uint32_t)0x000A0800U)
#define SYSCTL_MGMT_RTC_OFS                      ((uint32_t)0x00094800U)
#define SYSCTL_MGMT_GPTIMER16B2CCQEILP0_OFS      ((uint32_t)0x00090800U)
#define SYSCTL_MGMT_GPTIMER16B2CCLP0_OFS         ((uint32_t)0x00084800U)
#define SYSCTL_MGMT_WWDTLP1_OFS                  ((uint32_t)0x00082800U)
#define SYSCTL_MGMT_WWDTLP0_OFS                  ((uint32_t)0x00080800U)
#define SYSCTL_MGMT_VREF_OFS                     ((uint32_t)0x00030800U)
#define SYSCTL_MGMT_OPAMP1_OFS                   ((uint32_t)0x00022800U)
#define SYSCTL_MGMT_OPAMP0_OFS                   ((uint32_t)0x00020800U)
#define SYSCTL_MGMT_DAC12B0_OFS                  ((uint32_t)0x00018800U)
#define SYSCTL_MGMT_ANACOMP2_OFS                 ((uint32_t)0x0000C800U)
#define SYSCTL_MGMT_ANACOMP1_OFS                 ((uint32_t)0x0000A800U)
#define SYSCTL_MGMT_ANACOMP0_OFS                 ((uint32_t)0x00008800U)
#define SYSCTL_MGMT_ADC12B4MSPS1_OFS             ((uint32_t)0x00002800U)
#define SYSCTL_SOCLOCK_OFS                       ((uint32_t)0x00001000U)
#define SYSCTL_MGMT_ADC12B4MSPS0_OFS             ((uint32_t)0x00000800U)


/** @addtogroup SYSCTL_MGMT_TMALITE1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00900800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00900804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00900814) IP State Register - Read Only */
} SYSCTL_MGMT_TMALITE1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_TMALITE1 */

