TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/** @addtogroup SYSCTL_MGMT_GPTIMER32B2CC0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00870800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00870804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00870814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER32B2CC0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER32B2CC0 */

/** @addtogroup SYSCTL_MGMT_GPTIMER16B2CCSP1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x0086A800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x0086A804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x0086A814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16B2CCSP1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16B2CCSP1 */

/** @addtogroup SYSCTL_MGMT_GPTIMER16B2CCSP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00868800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00868804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00868814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16B2CCSP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16B2CCSP0 */

/** @addtogroup SYSCTL_MGMT_GPTIMER16BADV2CC0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00862800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00862804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00862814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16BADV2CC0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16BADV2CC0 */

/** @addtogroup SYSCTL_MGMT_GPTIMER16BADV4CC0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00860800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00860804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00860814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16BADV4CC0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16BADV4CC0 */

/** @addtogroup SYSCTL_MGMT_MCAN0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x0050E800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x0050E804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x0050E814) IP State Register - Read Only */
} SYSCTL_MGMT_MCAN0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_MCAN0 */

/** @addtogroup SYSCTL_MGMT_UART0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00500800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00500804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00500808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00500814) IP State Register - Read Only */
} SYSCTL_MGMT_UART0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_UART0 */

/** @addtogroup SYSCTL_MGMT_SPI1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x0046A800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x0046A804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x0046A808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x0046A814) IP State Register - Read Only */
} SYSCTL_MGMT_SPI1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_SPI1 */

/** @addtogroup SYSCTL_MGMT_SPI0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00468800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00468804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00468808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00468814) IP State Register - Read Only */
} SYSCTL_MGMT_SPI0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_SPI0 */

/** @addtogroup SYSCTL_MGMT_TRNG
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00444800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00444804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00444814) IP State Register - Read Only */
} SYSCTL_MGMT_TRNG_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_TRNG */

