TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/** @addtogroup SYSCTL_MGMT_AES
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00442800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00442804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00442814) IP State Register - Read Only */
} SYSCTL_MGMT_AES_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_AES */

/** @addtogroup SYSCTL_MGMT_CRC0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00440800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00440804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00440814) IP State Register - Read Only */
} SYSCTL_MGMT_CRC0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_CRC0 */

/** @addtogroup SYSCTL_MGMT_MATHACL
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00410800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00410804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00410814) IP State Register - Read Only */
} SYSCTL_MGMT_MATHACL_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_MATHACL */

/** @addtogroup SYSCTL_MGMT_UARTADVLP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00108800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00108804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00108808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00108814) IP State Register - Read Only */
} SYSCTL_MGMT_UARTADVLP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_UARTADVLP0 */

/** @addtogroup SYSCTL_MGMT_UARTLP1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00102800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00102804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00102808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00102814) IP State Register - Read Only */
} SYSCTL_MGMT_UARTLP1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_UARTLP1 */

/** @addtogroup SYSCTL_MGMT_UARTLP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00100800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00100804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00100808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00100814) IP State Register - Read Only */
} SYSCTL_MGMT_UARTLP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_UARTLP0 */

/** @addtogroup SYSCTL_MGMT_I2C1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x000F2800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x000F2804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x000F2808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x000F2814) IP State Register - Read Only */
} SYSCTL_MGMT_I2C1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_I2C1 */

/** @addtogroup SYSCTL_MGMT_I2C0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x000F0800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x000F0804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x000F0808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x000F0814) IP State Register - Read Only */
} SYSCTL_MGMT_I2C0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_I2C0 */

/** @addtogroup SYSCTL_MGMT_GPIO1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x000A2800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x000A2804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x000A2814) IP State Register - Read Only */
} SYSCTL_MGMT_GPIO1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPIO1 */

/** @addtogroup SYSCTL_MGMT_GPIO0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x000A0800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x000A0804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x000A0814) IP State Register - Read Only */
} SYSCTL_MGMT_GPIO0_Regs;

