TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/*@}*/ /* end of group SYSCTL_MGMT_GPIO0 */

/** @addtogroup SYSCTL_MGMT_RTC
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00094800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00094804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00094808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00094814) IP State Register - Read Only */
} SYSCTL_MGMT_RTC_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_RTC */

/** @addtogroup SYSCTL_MGMT_GPTIMER16B2CCQEILP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00090800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00090804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00090814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16B2CCQEILP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16B2CCQEILP0 */

/** @addtogroup SYSCTL_MGMT_GPTIMER16B2CCLP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00084800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00084804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00084814) IP State Register - Read Only */
} SYSCTL_MGMT_GPTIMER16B2CCLP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_GPTIMER16B2CCLP0 */

/** @addtogroup SYSCTL_MGMT_WWDTLP1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00082800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00082804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00082814) IP State Register - Read Only */
} SYSCTL_MGMT_WWDTLP1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_WWDTLP1 */

/** @addtogroup SYSCTL_MGMT_WWDTLP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00080800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00080804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00080814) IP State Register - Read Only */
} SYSCTL_MGMT_WWDTLP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_WWDTLP0 */

/** @addtogroup SYSCTL_MGMT_VREF
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00030800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00030804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00030814) IP State Register - Read Only */
} SYSCTL_MGMT_VREF_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_VREF */

/** @addtogroup SYSCTL_MGMT_OPAMP1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00022800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00022804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00022814) IP State Register - Read Only */
} SYSCTL_MGMT_OPAMP1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_OPAMP1 */

/** @addtogroup SYSCTL_MGMT_OPAMP0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00020800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00020804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00020814) IP State Register - Read Only */
} SYSCTL_MGMT_OPAMP0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_OPAMP0 */

/** @addtogroup SYSCTL_MGMT_DAC12B0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00018800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00018804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00018814) IP State Register - Read Only */
} SYSCTL_MGMT_DAC12B0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_DAC12B0 */

/** @addtogroup SYSCTL_MGMT_ANACOMP2
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x0000C800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x0000C804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x0000C808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x0000C814) IP State Register - Read Only */
} SYSCTL_MGMT_ANACOMP2_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_ANACOMP2 */

/** @addtogroup SYSCTL_MGMT_ANACOMP1
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x0000A800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x0000A804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x0000A808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x0000A814) IP State Register - Read Only */
} SYSCTL_MGMT_ANACOMP1_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_ANACOMP1 */

/** @addtogroup SYSCTL_MGMT_ANACOMP0
  @{
*/

