TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/** @addtogroup SYSCTL_MGMT_ADC12B4MSPS0
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) IP Enable Register */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Power Control Register - Write Only Register,
                                                      Always Read as 0 */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) IP Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) IP State Register - Read Only */
} SYSCTL_MGMT_ADC12B4MSPS0_Regs;

/*@}*/ /* end of group SYSCTL_MGMT_ADC12B4MSPS0 */

/** @addtogroup SYSCTL
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  SYSCTL_MGMT_ADC12B4MSPS0_Regs  MGMT_ADC12B4MSPS0;                 /* !< (@ 0x00000800) SYSCTL Mgmt sub-region for IPD adc12b4msps0 */
       uint32_t RESERVED1[506];
  SYSCTL_SOCLOCK_Regs  SOCLOCK;                           /* !< (@ 0x00001000) SYSCTL SOCLOCK Region */
       uint32_t RESERVED2[1276];
  SYSCTL_MGMT_ADC12B4MSPS1_Regs  MGMT_ADC12B4MSPS1;                 /* !< (@ 0x00002800) SYSCTL Mgmt sub-region for IPD adc12b4msps1 */
       uint32_t RESERVED3[6138];
  SYSCTL_MGMT_ANACOMP0_Regs  MGMT_ANACOMP0;                     /* !< (@ 0x00008800) SYSCTL Mgmt sub-region for IPD anacomp0 */
       uint32_t RESERVED4[2042];
  SYSCTL_MGMT_ANACOMP1_Regs  MGMT_ANACOMP1;                     /* !< (@ 0x0000A800) SYSCTL Mgmt sub-region for IPD anacomp1 */
       uint32_t RESERVED5[2042];
  SYSCTL_MGMT_ANACOMP2_Regs  MGMT_ANACOMP2;                     /* !< (@ 0x0000C800) SYSCTL Mgmt sub-region for IPD anacomp2 */
       uint32_t RESERVED6[12282];
  SYSCTL_MGMT_DAC12B0_Regs  MGMT_DAC12B0;                      /* !< (@ 0x00018800) SYSCTL Mgmt sub-region for IPD dac12b0 */
       uint32_t RESERVED7[8186];
  SYSCTL_MGMT_OPAMP0_Regs  MGMT_OPAMP0;                       /* !< (@ 0x00020800) SYSCTL Mgmt sub-region for IPD opamp0 */
       uint32_t RESERVED8[2042];
  SYSCTL_MGMT_OPAMP1_Regs  MGMT_OPAMP1;                       /* !< (@ 0x00022800) SYSCTL Mgmt sub-region for IPD opamp1 */
       uint32_t RESERVED9[14330];
  SYSCTL_MGMT_VREF_Regs  MGMT_VREF;                         /* !< (@ 0x00030800) SYSCTL Mgmt sub-region for IPD vref */
       uint32_t RESERVED10[81914];
  SYSCTL_MGMT_WWDTLP0_Regs  MGMT_WWDTLP0;                      /* !< (@ 0x00080800) SYSCTL Mgmt sub-region for IPD wwdtlp0 */
       uint32_t RESERVED11[2042];
  SYSCTL_MGMT_WWDTLP1_Regs  MGMT_WWDTLP1;                      /* !< (@ 0x00082800) SYSCTL Mgmt sub-region for IPD wwdtlp1 */
       uint32_t RESERVED12[2042];
  SYSCTL_MGMT_GPTIMER16B2CCLP0_Regs  MGMT_GPTIMER16B2CCLP0;             /* !< (@ 0x00084800) SYSCTL Mgmt sub-region for IPD gptimer16b2cclp0 */
       uint32_t RESERVED13[12282];
  SYSCTL_MGMT_GPTIMER16B2CCQEILP0_Regs  MGMT_GPTIMER16B2CCQEILP0;          /* !< (@ 0x00090800) SYSCTL Mgmt sub-region for IPD gptimer16b2ccqeilp0 */
       uint32_t RESERVED14[4090];
  SYSCTL_MGMT_RTC_Regs  MGMT_RTC;                          /* !< (@ 0x00094800) SYSCTL Mgmt sub-region for IPD rtc */
       uint32_t RESERVED15[12282];
  SYSCTL_MGMT_GPIO0_Regs  MGMT_GPIO0;                        /* !< (@ 0x000A0800) SYSCTL Mgmt sub-region for IPD gpio0 */
       uint32_t RESERVED16[2042];
  SYSCTL_MGMT_GPIO1_Regs  MGMT_GPIO1;                        /* !< (@ 0x000A2800) SYSCTL Mgmt sub-region for IPD gpio1 */
       uint32_t RESERVED17[79866];
  SYSCTL_MGMT_I2C0_Regs  MGMT_I2C0;                         /* !< (@ 0x000F0800) SYSCTL Mgmt sub-region for IPD i2c0 */
       uint32_t RESERVED18[2042];
  SYSCTL_MGMT_I2C1_Regs  MGMT_I2C1;                         /* !< (@ 0x000F2800) SYSCTL Mgmt sub-region for IPD i2c1 */
       uint32_t RESERVED19[14330];
  SYSCTL_MGMT_UARTLP0_Regs  MGMT_UARTLP0;                      /* !< (@ 0x00100800) SYSCTL Mgmt sub-region for IPD uartlp0 */
       uint32_t RESERVED20[2042];
  SYSCTL_MGMT_UARTLP1_Regs  MGMT_UARTLP1;                      /* !< (@ 0x00102800) SYSCTL Mgmt sub-region for IPD uartlp1 */
       uint32_t RESERVED21[6138];
  SYSCTL_MGMT_UARTADVLP0_Regs  MGMT_UARTADVLP0;                   /* !< (@ 0x00108800) SYSCTL Mgmt sub-region for IPD uartadvlp0 */
       uint32_t RESERVED22[794618];
  SYSCTL_MGMT_MATHACL_Regs  MGMT_MATHACL;                      /* !< (@ 0x00410800) SYSCTL Mgmt sub-region for IPD mathacl */
       uint32_t RESERVED23[49146];
  SYSCTL_MGMT_CRC0_Regs  MGMT_CRC0;                         /* !< (@ 0x00440800) SYSCTL Mgmt sub-region for IPD crc0 */
       uint32_t RESERVED24[2042];
  SYSCTL_MGMT_AES_Regs  MGMT_AES;                          /* !< (@ 0x00442800) SYSCTL Mgmt sub-region for IPD aes */
       uint32_t RESERVED25[2042];
  SYSCTL_MGMT_TRNG_Regs  MGMT_TRNG;                         /* !< (@ 0x00444800) SYSCTL Mgmt sub-region for IPD trng */
       uint32_t RESERVED26[36858];
  SYSCTL_MGMT_SPI0_Regs  MGMT_SPI0;                         /* !< (@ 0x00468800) SYSCTL Mgmt sub-region for IPD spi0 */
       uint32_t RESERVED27[2042];
  SYSCTL_MGMT_SPI1_Regs  MGMT_SPI1;                         /* !< (@ 0x0046A800) SYSCTL Mgmt sub-region for IPD spi1 */
       uint32_t RESERVED28[153594];
  SYSCTL_MGMT_UART0_Regs  MGMT_UART0;                        /* !< (@ 0x00500800) SYSCTL Mgmt sub-region for IPD uart0 */
       uint32_t RESERVED29[14330];
  SYSCTL_MGMT_MCAN0_Regs  MGMT_MCAN0;                        /* !< (@ 0x0050E800) SYSCTL Mgmt sub-region for IPD mcan0 */
       uint32_t RESERVED30[870394];
  SYSCTL_MGMT_GPTIMER16BADV4CC0_Regs  MGMT_GPTIMER16BADV4CC0;            /* !< (@ 0x00860800) SYSCTL Mgmt sub-region for IPD gptimer16badv4cc0 */
       uint32_t RESERVED31[2042];
  SYSCTL_MGMT_GPTIMER16BADV2CC0_Regs  MGMT_GPTIMER16BADV2CC0;            /* !< (@ 0x00862800) SYSCTL Mgmt sub-region for IPD gptimer16badv2cc0 */
       uint32_t RESERVED32[6138];
  SYSCTL_MGMT_GPTIMER16B2CCSP0_Regs  MGMT_GPTIMER16B2CCSP0;             /* !< (@ 0x00868800) SYSCTL Mgmt sub-region for IPD gptimer16b2ccsp0 */
       uint32_t RESERVED33[2042];
  SYSCTL_MGMT_GPTIMER16B2CCSP1_Regs  MGMT_GPTIMER16B2CCSP1;             /* !< (@ 0x0086A800) SYSCTL Mgmt sub-region for IPD gptimer16b2ccsp1 */
       uint32_t RESERVED34[6138];
  SYSCTL_MGMT_GPTIMER32B2CC0_Regs  MGMT_GPTIMER32B2CC0;               /* !< (@ 0x00870800) SYSCTL Mgmt sub-region for IPD gptimer32b2cc0 */
       uint32_t RESERVED35[147450];
  SYSCTL_MGMT_TMALITE1_Regs  MGMT_TMALITE1;                     /* !< (@ 0x00900800) SYSCTL Mgmt sub-region for IPD tmalite1 */
} SYSCTL_Regs;

/*@}*/ /* end of group SYSCTL */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

