TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/m0p/sysctl/hw_sysctl_mspm0g1x0x_g3x0x.h
/* SYSCTL_MGMT_ANACOMP2_STAT Bits */
/* SYSCTL_MGMT_ANACOMP2_STAT[RESETSTKY] Bits */
#define SYSCTL_MGMT_ANACOMP2_STAT_RESETSTKY_OFS  (16)                            /* !< RESETSTKY Offset */
#define SYSCTL_MGMT_ANACOMP2_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< IP has been Reset */
#define SYSCTL_MGMT_ANACOMP2_STAT_RESETSTKY_CLEAR ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP2_STAT_RESETSTKY_SET  ((uint32_t)0x00010000U)

/* SYSCTL_MGMT_ANACOMP1_PWREN Bits */
/* SYSCTL_MGMT_ANACOMP1_PWREN[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP1_PWREN_KEY_OFS       (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP1_PWREN_KEY_MASK      ((uint32_t)0xFF000000U)         /* !< KEY to Allow Enable State Change --
                                                                                    0x26 */
#define SYSCTL_MGMT_ANACOMP1_PWREN_KEY_UNLOCK    ((uint32_t)0x26000000U)
/* SYSCTL_MGMT_ANACOMP1_PWREN[ENABLE] Bits */
#define SYSCTL_MGMT_ANACOMP1_PWREN_ENABLE_OFS    (0)                             /* !< ENABLE Offset */
#define SYSCTL_MGMT_ANACOMP1_PWREN_ENABLE_MASK   ((uint32_t)0x00000001U)         /* !< IP Enable */
#define SYSCTL_MGMT_ANACOMP1_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP1_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)

/* SYSCTL_MGMT_ANACOMP1_RSTCTL Bits */
/* SYSCTL_MGMT_ANACOMP1_RSTCTL[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_KEY_OFS      (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_KEY_MASK     ((uint32_t)0xFF000000U)         /* !< KEY to Allow Reset -- 0xb1 */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_KEY_UNLOCK   ((uint32_t)0xB1000000U)
/* SYSCTL_MGMT_ANACOMP1_RSTCTL[RESETSTKYCLR] Bits */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESET STICKY Bit */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETSTKYCLR_CLEAR ((uint32_t)0x00000002U)
/* SYSCTL_MGMT_ANACOMP1_RSTCTL[RESETASSERT] Bits */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert Reset to IP Domain. */
#define SYSCTL_MGMT_ANACOMP1_RSTCTL_RESETASSERT_DO ((uint32_t)0x00000001U)

/* SYSCTL_MGMT_ANACOMP1_CLKCFG Bits */
/* SYSCTL_MGMT_ANACOMP1_CLKCFG[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_KEY_OFS      (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_KEY_MASK     ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_KEY_UNLOCK   ((uint32_t)0xA9000000U)
/* SYSCTL_MGMT_ANACOMP1_CLKCFG[BLOCKASYNC] Bits */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP1_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)

/* SYSCTL_MGMT_ANACOMP1_STAT Bits */
/* SYSCTL_MGMT_ANACOMP1_STAT[RESETSTKY] Bits */
#define SYSCTL_MGMT_ANACOMP1_STAT_RESETSTKY_OFS  (16)                            /* !< RESETSTKY Offset */
#define SYSCTL_MGMT_ANACOMP1_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< IP has been Reset */
#define SYSCTL_MGMT_ANACOMP1_STAT_RESETSTKY_CLEAR ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP1_STAT_RESETSTKY_SET  ((uint32_t)0x00010000U)

/* SYSCTL_MGMT_ANACOMP0_PWREN Bits */
/* SYSCTL_MGMT_ANACOMP0_PWREN[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP0_PWREN_KEY_OFS       (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP0_PWREN_KEY_MASK      ((uint32_t)0xFF000000U)         /* !< KEY to Allow Enable State Change --
                                                                                    0x26 */
#define SYSCTL_MGMT_ANACOMP0_PWREN_KEY_UNLOCK    ((uint32_t)0x26000000U)
/* SYSCTL_MGMT_ANACOMP0_PWREN[ENABLE] Bits */
#define SYSCTL_MGMT_ANACOMP0_PWREN_ENABLE_OFS    (0)                             /* !< ENABLE Offset */
#define SYSCTL_MGMT_ANACOMP0_PWREN_ENABLE_MASK   ((uint32_t)0x00000001U)         /* !< IP Enable */
#define SYSCTL_MGMT_ANACOMP0_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP0_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)

/* SYSCTL_MGMT_ANACOMP0_RSTCTL Bits */
/* SYSCTL_MGMT_ANACOMP0_RSTCTL[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_KEY_OFS      (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_KEY_MASK     ((uint32_t)0xFF000000U)         /* !< KEY to Allow Reset -- 0xb1 */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_KEY_UNLOCK   ((uint32_t)0xB1000000U)
/* SYSCTL_MGMT_ANACOMP0_RSTCTL[RESETSTKYCLR] Bits */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESET STICKY Bit */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETSTKYCLR_CLEAR ((uint32_t)0x00000002U)
/* SYSCTL_MGMT_ANACOMP0_RSTCTL[RESETASSERT] Bits */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert Reset to IP Domain. */
#define SYSCTL_MGMT_ANACOMP0_RSTCTL_RESETASSERT_DO ((uint32_t)0x00000001U)

/* SYSCTL_MGMT_ANACOMP0_CLKCFG Bits */
/* SYSCTL_MGMT_ANACOMP0_CLKCFG[KEY] Bits */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_KEY_OFS      (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_KEY_MASK     ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_KEY_UNLOCK   ((uint32_t)0xA9000000U)
/* SYSCTL_MGMT_ANACOMP0_CLKCFG[BLOCKASYNC] Bits */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP0_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)

/* SYSCTL_MGMT_ANACOMP0_STAT Bits */
/* SYSCTL_MGMT_ANACOMP0_STAT[RESETSTKY] Bits */
#define SYSCTL_MGMT_ANACOMP0_STAT_RESETSTKY_OFS  (16)                            /* !< RESETSTKY Offset */
#define SYSCTL_MGMT_ANACOMP0_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< IP has been Reset */
#define SYSCTL_MGMT_ANACOMP0_STAT_RESETSTKY_CLEAR ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ANACOMP0_STAT_RESETSTKY_SET  ((uint32_t)0x00010000U)

/* SYSCTL_MGMT_ADC12B4MSPS1_PWREN Bits */
/* SYSCTL_MGMT_ADC12B4MSPS1_PWREN[KEY] Bits */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_KEY_OFS   (24)                            /* !< KEY Offset */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_KEY_MASK  ((uint32_t)0xFF000000U)         /* !< KEY to Allow Enable State Change --
                                                                                    0x26 */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_KEY_UNLOCK ((uint32_t)0x26000000U)
/* SYSCTL_MGMT_ADC12B4MSPS1_PWREN[ENABLE] Bits */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< IP Enable */
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)
#define SYSCTL_MGMT_ADC12B4MSPS1_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)

